# Задача 1: Заполните массив элементами арифметической
# прогрессии. Её первый элемент, разность и количество
# элементов нужно ввести с клавиатуры. Формула для
# получения n-го члена прогрессии: a n = a1 + (n-1) * d.
# Каждое число вводится с новой строки.

# Ввод данных с клавиатуры
a1 = int(input("Введите первый элемент прогрессии (a1): "))
d = int(input("Введите разность прогрессии (d): "))
n = int(input("Введите количество элементов (n): "))

# Создание массива с элементами прогрессии
progression = []
for i in range(n):
    an = a1 + i * d
    progression.append(an)

# Вывод элементов прогрессии
print(" ".join(map(str, progression)))
