# Задача №3. Решение в группах
# Напишите функцию same_by(characteristic, objects), которая 
# проверяет, все ли объекты имеют одинаковое значение 
# некоторой характеристики, и возвращают True, если это так. 
# Если значение характеристики для разных объектов 
# отличается - то False. Для пустого набора объектов, функция 
# должна возвращать True. Аргумент characteristic - это 
# функция, которая принимает объект и вычисляет его 
# характеристику.

def same_by(characteristic, objects):
    if not objects:
        return True  # Если список объектов пустой, вернуть True
    
    # Получаем значение характеристики для первого объекта
    first_value = characteristic(objects[0])
    
    # Проверяем, что все остальные объекты имеют такое же значение характеристики
    for obj in objects[1:]:
        if characteristic(obj) != first_value:
            return False  # Если характеристики отличаются, вернуть False
    
    return True  # Если все характеристики одинаковы, вернуть True

# Пример использования функции
values = [0, 2, 10, 6]
if same_by(lambda x: x % 2, values):
    print('same')
else:
    print('different')
