# Задача №2. Решение в группах
# В некоторой школе решили набрать три новых 
# математических класса и оборудовать кабинеты для 
# них новыми партами. За каждой партой может сидеть 
# два учащихся. Известно количество учащихся в 
# каждом из трех классов. Выведите наименьшее 
# число парт, которое нужно приобрести для них.
# Input: 20 21 22(ввод чисел НЕ в одну строку)
# Output: 32

a = int(input("Число учеников Класса N=1:"))
b = int(input("Число учеников Класса N=2:"))
c = int(input("Число учеников Класса N=3:"))

s1 = ((a + 1) // 2 )
s2 = ((b + 1) // 2 )
s3 = ((c + 1) // 2 ) # Добавляем + 1 потому что в некоторых классах нету четного количества учеников
print("Кол-во парт:")
print(f'N-1 класс - {s1}')
print(f'N-2 класс - {s2}')
print(f'N-3 класс - {s3}')
print("ИТОГО:")
print(f'{s1 + s2 + s3} Парты')