""" Задача 4: Требуется определить, можно ли от шоколадки размером n
× m долек отломить k долек, если разрешается сделать один разлом по
прямой между дольками (то есть разломить шоколадку на два
прямоугольника).
Пример :
3 2 4 -> yes
3 2 1 -> no
 """
a = int(input("Введите длину шоколада по горизонтали :"))
b = int(input("Введите длину шоколада по вертикали :"))
c = int(input("сколько хотите отломать долек? :"))

if c <= b * a  and c % a == 0 or c % b == 0:
    print('Можно')
else:
    print('Нельзя')