""" Задача 3: Вы пользуетесь общественным транспортом? Вероятно, вы
расплачивались за проезд и получали билет с номером. Счастливым
билетом называют такой билет с шестизначным номером, где сумма
первых трех цифр равна сумме последних трех. Т.е. билет с номером
385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать
программу, которая проверяет счастливость билета.
ПРИМЕР:
385916 -> yes
123456 -> no """

# ticket1 = int(input("Введите первые 3-и цифры билета:"))

# summa1 = 0

# while ticket1 > 0:
#     x = ticket1 % 10 
#     ticket1 = ticket1 // 10 
#     summa1 = summa1 + x 
    
# ticket2 = int(input("Введите вторые 3-и цифры билета:"))

# summa2 = 0

# while ticket2 > 0:
#     x = ticket2 % 10 
#     ticket2 = ticket2 // 10 
#     summa2 = summa2 + x 

# if summa1 == summa2:
#    print("Ваш билет счастливый !!!")
# else:
#    print("Ваш билет обычный :(") 

n = int(input("Введите номер билета:"))
ticket_str = str(n) # Номер билета преобразуется в строку и сохраняется в переменную ticket_str. Это необходимо для того, чтобы легко получить доступ к отдельным цифрам номера билета.


if len(ticket_str) == 6: # Проверяется, состоит ли номер билета из 6 цифр. Если нет, то программа ничего не делает и просто завершится.
    first_half_sum = sum(int(digit) for digit in ticket_str[:3]) # Используется срез строки ticket_str[:3] для получения первых трех цифр номера билета. Затем каждая цифра преобразуется в целое число, и их сумма сохраняется в переменную first_half_sum.
    second_half_sum = sum(int(digit) for digit in ticket_str[3:]) # Используется срез строки ticket_str[3:] для получения последних трех цифр номера билета. Затем каждая цифра преобразуется в целое число, и их сумма сохраняется в переменную second_half_sum.
    if first_half_sum == second_half_sum:
        print('Ваш билет счастливый !!!')
    else:
        print('Ваш билет обычный :(')

