# Задача №19. Решение в группах
# Дана последовательность из N целых чисел и число 
# K. Необходимо сдвинуть всю последовательность 
# (сдвиг - циклический) на K элементов вправо, K – 
# положительное число.
# Input: [1, 2, 3, 4, 5] k = 3
# Output: [4, 5, 1, 2, 3]
# Примечание: Пользователь может вводить значения 
# списка или список задан изначально.
# Ввод данных от пользователя
numbers = list(map(int, input("Введите числа через пробел: ").split()))
k = int(input("Введите значение K: "))
def cyclic_shift(lst, k):
    # Длина списка
    n = len(lst)
    # Нормализуем значение k, если оно больше длины списка
    k = k % n
    # Выполняем сдвиг с помощью срезов
    return lst[-k:] + lst[:-k]

# Выполняем сдвиг
shifted_numbers = cyclic_shift(numbers, k)

# Выводим результат
print(shifted_numbers)
