# Задача №21. Решение в группах
# Напишите программу для печати всех уникальных 
# значений в словаре. 
# Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, 
# {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII 
# ":" S007 "}] 
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}
# Примечание: Список словарей задан изначально. 
# Пользователь его не вводит
# Исходный список словарей
input_list = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, 
              {"VI": "S005"}, {"VII": " S005 "}, {" V ": " S009 "}, {" VIII ": " S007 "}]

# Создаем пустое множество для хранения уникальных значений
unique_values = set()

# Проходим по каждому словарю в списке
for d in input_list:
    for value in d.values():
        unique_values.add(value)  # Добавляем значение в множество 

# Выводим множество уникальных значений
print(unique_values)
