# Задача №23. Решение в группах
# Дан массив, состоящий из целых чисел. Напишите 
# программу, которая подсчитает количество 
# элементов массива, больших предыдущего (элемента 
# с предыдущим номером) 
# Input: [0, -1, 5, 2, 3]
# Output: 2 (-1 < 5, 2 < 3)
# Примечание: Пользователь может вводить значения 
# списка или список задан изначально.
def count_and_show_greater_than_previous(numbers):
    count = 0  # Инициализируем счетчик
    pairs = []  # Список для хранения пар элементов

    # Проходим по массиву, начиная со второго элемента
    for i in range(1, len(numbers)):
        if numbers[i] > numbers[i - 1]:
            count += 1  # Увеличиваем счетчик, если текущий элемент больше предыдущего
            pairs.append(f"{numbers[i - 1]} < {numbers[i]}")  # Добавляем пару в список

    # Формируем строку результата
    result = f"{count} ({', '.join(pairs)})"
    return result

# Пример использования
numbers = [0, -1, 5, 2, 3]
result = count_and_show_greater_than_previous(numbers)
print(result)  # Вывод: 2 (-1 < 5, 2 < 3)
