""" Задача 16: Требуется вычислить, сколько раз встречается некоторое
число X в массиве A[1..N]. Пользователь в первой строке вводит
натуральное число N – количество элементов в массиве. В последующих 
строках записаны N целых чисел Ai
. Последняя строка содержит число X """
# 5
# 1 2 3 4 5
# 3
# -> 1
# Ввод данных от пользователя
N = int(input("Введите количество элементов в массиве: "))
A = [int(input()) for _ in range(N)]
X = int(input("Введите число X: "))

# Подсчет количества вхождений X в массив A
count = A.count(X)

# Вывод результата
print(f"-> {count}")
