""" Задача №39. Решение в группах
Даны два массива чисел. Требуется вывести те элементы
первого массива (в том порядке, в каком они идут в первом
массиве), которых нет во втором массиве. Пользователь вводит 
число N - количество элементов в первом массиве, затем N
чисел - элементы массива. Затем число M - количество
элементов во втором массиве. Затем элементы второго массива """


# Считываем данные
n = int(input("Введите количество элементов в первом массиве: "))
array1 = [int(input()) for _ in range(n)]  # Элементы первого массива

m = int(input("Введите количество элементов во втором массиве: "))
array2 = set(int(input()) for _ in range(m))  # Элементы второго массива в множестве для эффективности поиска

# Выводим элементы первого массива, которых нет во втором массиве
print("Элементы первого массива, которых нет во втором массиве:")
for num in array1:
    if num not in array2:
        print(num, end=' ')


