# Решение в группах
# Дан массив, состоящий из целых чисел. Напишите
# программу, которая в данном массиве определит
# количество элементов, у которых два соседних и, при
# этом, оба соседних элемента меньше данного. Сначала
# вводится число N — количество элементов в массиве 
# Далее записаны N чисел — элементы массива. Массив
# состоит из целых чисел
# Ввод данных
n = int(input("Введите количество элементов в массиве: "))
array = list(map(int, input("Введите элементы массива через пробел: ").split()))

# Счетчик элементов, у которых два соседа меньше
count = 0

# Проверяем каждый элемент массива (кроме первого и последнего)
for i in range(1, n - 1):
    if array[i] < array[i - 1] and array[i] < array[i + 1]:
        count += 1

# Вывод результата
print("Количество элементов, у которых два соседних элемента меньше данного:", count)
