# Задача №43. Решение в группах
# Дан список чисел. Посчитайте, сколько в нем пар
# элементов, равных друг другу. Считается, что любые
# два элемента, равные друг другу образуют одну пару,
# которую необходимо посчитать. Вводится список
# чисел. Все числа списка находятся на разных
# строках.
# Создаем словарь для подсчета встречающихся элементов
nums_count = {}

# Считываем список чисел
print("Введите числа списка, каждое число на новой строке. Для завершения введите пустую строку:")
while True:
    num = input()
    if num == "":
        break
    nums_count[num] = nums_count.get(num, 0) + 1

# Считаем количество пар
pairs_count = 0
for count in nums_count.values():
    pairs_count += count * (count - 1) // 2

# Выводим результат
print("Количество пар элементов, равных друг другу:", pairs_count)
