# Задача №45. Решение в группах
# Два различных натуральных числа n и m называются
# дружественными, если сумма делителей числа n
# (включая 1, но исключая само n) равна числу m и
# наоборот. Например, 220 и 284 – дружественные числа.
# По данному числу k выведите все пары дружественных
# чисел, каждое из которых не превосходит k. Программа
# получает на вход одно натуральное число k, не
# превосходящее 105
# . Программа должна вывести все
# пары дружественных чисел, каждое из которых не
# превосходит k. Пары необходимо выводить по одной в
# строке, разделяя пробелами. Каждая пара должна быть
# выведена только один раз (перестановка чисел новую
# пару не дает).

# Функция для подсчета суммы делителей числа
def sum_of_divisors(n):
    divisors_sum = 1  # 1 всегда является делителем
    for i in range(2, int(n**0.5) + 1):
        if n % i == 0:
            divisors_sum += i
            if n // i != i:  # Учитываем также другой делитель, если он отличается
                divisors_sum += n // i
    return divisors_sum

# Ввод числа k
k = int(input("Введите натуральное число k: "))

# Поиск и вывод пар дружественных чисел
print("Пары дружественных чисел, каждое из которых не превосходит k:")
for n in range(1, k + 1):
    m = sum_of_divisors(n)  # Находим сумму делителей числа n
    if m > n and sum_of_divisors(m) == n <= k:  # Проверяем условие дружественных чисел и ограничение k
        print(n, m)
