# Задача 22: 
""" Даны два неупорядоченных набора целых чисел (может быть, с
повторениями). Выдать без повторений в порядке возрастания все те числа, которые
встречаются в обоих наборах.
Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во
элементов второго множества. Затем пользователь вводит сами элементы множеств. """
# 11 6
# 2 4 6 8 10 12 10 8 6 4 2
# 3 6 9 12 15 18
# 6 12

# Запросить у пользователя количество элементов в множествах
n = int(input("Введите количество элементов первого множества: "))
m = int(input("Введите количество элементов второго множества: "))

# Запросить у пользователя элементы множеств
print("Введите элементы первого множества:")
set1 = {int(input()) for _ in range(n)}
print("Введите элементы второго множества:")
set2 = {int(input()) for _ in range(m)}

# Найти пересечение множеств и вывести результат
common_elements = sorted(set1 & set2)
print("Числа, встречающиеся в обоих множествах:")
for element in common_elements:
    print(element)
