# Задача 24: 
""" В фермерском хозяйстве в Карелии выращивают чернику. Она растет на
круглой грядке, причем кусты высажены только по окружности. Таким образом, у
каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
выросло различное число ягод – на i-ом кусте выросло ai
 ягод.
В этом фермерском хозяйстве внедрена система автоматического сбора черники.
Эта система состоит из управляющего модуля и нескольких собирающих модулей.
Собирающий модуль за один заход, находясь непосредственно перед некоторым
кустом, собирает ягоды с этого куста и с двух соседних с ним.
Напишите программу для нахождения максимального числа ягод, которое может
собрать за один заход собирающий модуль, находясь перед некоторым кустом
заданной во входном файле грядки. """
# 4 -> 1 2 3 4

# Пример списка с урожайностью кустов
berries = [4, 1, 7, 9, 5, 3, 2]

# Количество кустов
N = len(berries)

# Инициализируем максимальное количество собранных ягод
max_berries = 0

# Проходим по каждому кусту
for i in range(N):
    # Учитываем текущий куст и два соседних
    current_sum = berries[i] + berries[i - 1] + berries[(i + 1) % N]
    
    # Обновляем максимальное количество собранных ягод
    if current_sum > max_berries:
        max_berries = current_sum

# Выводим результат
print(max_berries)

