""" двух соседних кустов. Собирающий модуль находится перед определенным кустом, и он может выбирать, с какого куста начать сбор ягод.
Ваша задача - написать программу, которая определит максимальное число ягод, которое может собрать один собирающий модуль за один заход, находясь перед некоторым кустом грядки.
Входные данные:
На вход программе подается список arr, где arr[i] (1 ≤ arr[i] ≤ 1000) - урожайность i-го куста черники. Размер списка не превышает 1000 элементов.
Выходные данные:
Программа должна вывести одно целое число - максимальное количество ягод, которое может собрать собирающий модуль, находясь перед некоторым кустом грядки.
Пример использования На входе: """

def max_berries(arr):
    n = len(arr)
    max_berries_collected = 0

    for i in range(n):
        # Сумма ягод на текущем кусте и двух его соседних
        current_sum = arr[i] + arr[(i - 1) % n] + arr[(i + 1) % n]
        # Обновляем максимальное количество собранных ягод
        if current_sum > max_berries_collected:
            max_berries_collected = current_sum

    return max_berries_collected

# Пример входных данных
arr = [5, 8, 6, 4, 9, 2, 7, 3]

# Выводим результат
print(max_berries(arr))