# Домашка 1
""" Требуется вычислить, сколько раз встречается некоторое число k в массиве list_1.
Найдите количество и выведите его.

Пример:
list_1 = [1, 2, 3, 4, 5]
k = 3 //  1
"""

list_1 = [1, 2, 3, 4, 5]
print(list_1)
k = 3
count_k = list_1.count(k)
print(f'кол-во повторения цифры [3]: {count_k}',f'раз(а)')
print()

