"""Задача 3 Уставшие от необычно теплой зимы, жители решили узнать, 
действительно ли это самая длинная оттепель за всю историю 
наблюдений за погодой. Они обратились к синоптикам, а те, в 
свою очередь, занялись исследованиями статистики за 
прошлые годы. Их интересует, сколько дней длилась самая 
длинная оттепель. Оттепелью они называют период, в 
который среднесуточная температура ежедневно превышала 
0 градусов Цельсия. Напишите программу, помогающую 
синоптикам в работе.
Пользователь вводит число N – общее количество
рассматриваемых дней (1 ≤ N ≤ 100). В следующих строках
располагается N целых чисел.
Каждое число – среднесуточная температура в
соответствующий день. Температуры – целые числа и лежат в
диапазоне от –50 до 50
Input: 6 -> -20 30 -40 50 10 -10
Output: 2 """

""" n = int(input("Колл-во дней подсчета температуры:"))

k = 0 
max = 0

for i in range(n):
	x = int(input("ср.температура за сутки :"))
	if x > 0:
		k += 1
	else:
		if max < k:
			max = k
		k = 0

print(max)
 """

# Получаем количество дней от пользователя
N = int(input("Введите количество дней: "))

# Получаем температуры для каждого дня
temperatures = []
for _ in range(N):
    temperatures.append(int(input()))

# Инициализируем переменные для отслеживания текущей и максимальной оттепели
current_thaw_length = 0
max_thaw_length = 0

# Проходим по списку температур и вычисляем длину оттепели
for temp in temperatures:
    if temp > 0:
        current_thaw_length += 1
        if current_thaw_length > max_thaw_length:
            max_thaw_length = current_thaw_length
    else:
        current_thaw_length = 0

# Выводим результат
print(max_thaw_length)