""" На столе лежат n монеток. Некоторые из монеток лежат вверх решкой, а некоторые – гербом. Ваша задача - определить минимальное количество монеток, которые нужно перевернуть, чтобы все монетки лежали одной и той же стороной вверх.

Входные данные:

На вход программе подается список coins, где coins[i] равно 0, если i-я монетка лежит гербом вверх, и равно 1, если i-я монетка лежит решкой вверх. Размер списка не превышает 1000 элементов.

Выходные данные:

Программа должна вывести одно целое число - минимальное количество монеток, которые нужно перевернуть. """

coins = [0, 1, 0, 1, 1, 0]
eagle_coins = []
reshka_coins = []

for i in range(len(coins)):
    if coins[i] == 0:
        reshka_coins.append(coins[i])
    else:
        eagle_coins.append(coins[i])

res = 0

if len(reshka_coins) > len(eagle_coins):
    res = len(eagle_coins)
else:
    res = len(reshka_coins)

print(res)